test/good/duplicated-condition.cfg.dot
digraph "duplicated-condition" {
    node [shape=box];
    subgraph "cluster_test" {
        label="test";
        "test_68" [label="let a: Int = 1"];
        "test_69" [label="a = A > 5 ? A > 5 ? 1 : 2 : 3"];
        "test_70" [label="a = A > 5 ? 3 : A > 5 ? 1 : 2"];
        "test_71" [label="if (A > 5)"];
        "test_72" [label="a = 1"];
        "test_73" [label="return a",style=filled,fillcolor="#66A7DB"];
        "test_68" -> "test_69";
        "test_69" -> "test_70";
        "test_70" -> "test_71";
        "test_71" -> "test_72";
        "test_72" -> "test_73";
    }
}
